stress/filter/vegeta_log.txt
❯ cat stress/filter/targets.txt | ./vegeta attack -rate=1/1s -duration=30s | ./vegeta report && docker stats --no-stream
Requests      [total, rate, throughput]         30, 1.03, 1.03
Duration      [total, attack, wait]             29.009s, 29s, 9.17ms
Latencies     [min, mean, 50, 90, 95, 99, max]  3.68ms, 9.084ms, 9.193ms, 10.962ms, 11.314ms, 14.175ms, 14.175ms
Bytes In      [total, mean]                     5581635, 186054.50
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30  
Error Set:
CONTAINER ID   NAME               CPU %     MEM USAGE / LIMIT     MEM %     NET I/O           BLOCK I/O        PIDS
cb346b1af076   test_storage_app   0.00%     57.39MiB / 15.33GiB   0.37%     5GB / 7.75GB      9.12MB / 41MB    21
d202016509a4   test_storage_db    0.00%     91.68MiB / 15.33GiB   0.58%     76.1MB / 4.96GB   51.5MB / 191MB   9
❯ cat stress/filter/targets.txt | ./vegeta attack -rate=5/1s -duration=30s | ./vegeta report && docker stats --no-stream
Requests      [total, rate, throughput]         150, 5.03, 5.03
Duration      [total, attack, wait]             29.808s, 29.8s, 8.322ms
Latencies     [min, mean, 50, 90, 95, 99, max]  1.701ms, 8.772ms, 9.188ms, 11.559ms, 12.086ms, 15.191ms, 17.129ms
Bytes In      [total, mean]                     25583979, 170559.86
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:150  
Error Set:
CONTAINER ID   NAME               CPU %     MEM USAGE / LIMIT     MEM %     NET I/O           BLOCK I/O        PIDS
cb346b1af076   test_storage_app   0.00%     57.43MiB / 15.33GiB   0.37%     5.01GB / 7.78GB   9.12MB / 41MB    21
d202016509a4   test_storage_db    0.00%     91.36MiB / 15.33GiB   0.58%     76.2MB / 4.97GB   51.5MB / 191MB   9
❯ cat stress/filter/targets.txt | ./vegeta attack -rate=10/1s -duration=30s | ./vegeta report && docker stats --no-stream
Requests      [total, rate, throughput]         300, 10.03, 10.03
Duration      [total, attack, wait]             29.908s, 29.9s, 8.015ms
Latencies     [min, mean, 50, 90, 95, 99, max]  913.676µs, 8.533ms, 8.948ms, 11.327ms, 12.342ms, 14.397ms, 15.355ms
Bytes In      [total, mean]                     50005860, 166686.20
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:
CONTAINER ID   NAME               CPU %     MEM USAGE / LIMIT     MEM %     NET I/O           BLOCK I/O        PIDS
cb346b1af076   test_storage_app   0.00%     57.53MiB / 15.33GiB   0.37%     5.05GB / 7.83GB   9.12MB / 41MB    21
d202016509a4   test_storage_db    0.00%     91.35MiB / 15.33GiB   0.58%     76.4MB / 5.01GB   51.5MB / 191MB   9
❯ cat stress/filter/targets.txt | ./vegeta attack -rate=20/1s -duration=30s | ./vegeta report && docker stats --no-stream
Requests      [total, rate, throughput]         600, 20.03, 20.03
Duration      [total, attack, wait]             29.959s, 29.951s, 8.598ms
Latencies     [min, mean, 50, 90, 95, 99, max]  1.198ms, 9.206ms, 9.401ms, 12.861ms, 13.697ms, 16.594ms, 17.683ms
Bytes In      [total, mean]                     100011720, 166686.20
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set:
CONTAINER ID   NAME               CPU %     MEM USAGE / LIMIT     MEM %     NET I/O           BLOCK I/O        PIDS
cb346b1af076   test_storage_app   0.00%     57.77MiB / 15.33GiB   0.37%     5.11GB / 7.93GB   9.12MB / 41MB    21
d202016509a4   test_storage_db    0.02%     91.99MiB / 15.33GiB   0.59%     76.9MB / 5.07GB   51.5MB / 191MB   9
❯ cat stress/filter/targets.txt | ./vegeta attack -rate=30/1s -duration=30s | ./vegeta report && docker stats --no-stream
Requests      [total, rate, throughput]         900, 30.03, 30.03
Duration      [total, attack, wait]             29.975s, 29.966s, 8.444ms
Latencies     [min, mean, 50, 90, 95, 99, max]  971.855µs, 9.091ms, 9.558ms, 12.5ms, 13.235ms, 15.559ms, 17.566ms
Bytes In      [total, mean]                     150017580, 166686.20
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:900  
Error Set:
CONTAINER ID   NAME               CPU %     MEM USAGE / LIMIT     MEM %     NET I/O           BLOCK I/O        PIDS
cb346b1af076   test_storage_app   0.00%     57.8MiB / 15.33GiB    0.37%     5.21GB / 8.08GB   9.12MB / 41MB    21
d202016509a4   test_storage_db    0.02%     91.34MiB / 15.33GiB   0.58%     77.5MB / 5.17GB   51.5MB / 191MB   9
❯ cat stress/filter/targets.txt | ./vegeta attack -rate=50/1s -duration=30s | ./vegeta report && docker stats --no-stream
Requests      [total, rate, throughput]         1500, 50.03, 50.02
Duration      [total, attack, wait]             29.986s, 29.98s, 6.393ms
Latencies     [min, mean, 50, 90, 95, 99, max]  938.806µs, 8.14ms, 8.461ms, 11.575ms, 12.196ms, 14.266ms, 15.589ms
Bytes In      [total, mean]                     250029300, 166686.20
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:1500  
Error Set:
CONTAINER ID   NAME               CPU %     MEM USAGE / LIMIT     MEM %     NET I/O           BLOCK I/O        PIDS
cb346b1af076   test_storage_app   0.00%     57.39MiB / 15.33GiB   0.37%     5.37GB / 8.33GB   9.12MB / 41MB    21
d202016509a4   test_storage_db    0.00%     92.02MiB / 15.33GiB   0.59%     78.6MB / 5.33GB   51.5MB / 191MB   9
❯ cat stress/filter/targets.txt | ./vegeta attack -rate=100/1s -duration=30s | ./vegeta report && docker stats --no-stream
Requests      [total, rate, throughput]         3000, 100.03, 100.02
Duration      [total, attack, wait]             29.995s, 29.99s, 5.312ms
Latencies     [min, mean, 50, 90, 95, 99, max]  770.777µs, 6.271ms, 6.293ms, 9.71ms, 10.534ms, 12.381ms, 217.364ms
Bytes In      [total, mean]                     500058600, 166686.20
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:
CONTAINER ID   NAME               CPU %     MEM USAGE / LIMIT     MEM %     NET I/O           BLOCK I/O        PIDS
cb346b1af076   test_storage_app   0.00%     57.55MiB / 15.33GiB   0.37%     5.69GB / 8.84GB   9.12MB / 41MB    21
d202016509a4   test_storage_db    2.04%     94.13MiB / 15.33GiB   0.60%     80.8MB / 5.65GB   51.5MB / 191MB   10
❯ cat stress/filter/targets.txt | ./vegeta attack -rate=200/1s -duration=30s | ./vegeta report && docker stats --no-stream
Requests      [total, rate, throughput]         6000, 200.03, 199.99
Duration      [total, attack, wait]             30.002s, 29.995s, 6.441ms
Latencies     [min, mean, 50, 90, 95, 99, max]  455.348µs, 4.851ms, 4.64ms, 8.154ms, 9.053ms, 10.699ms, 14.652ms
Bytes In      [total, mean]                     1000117200, 166686.20
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:6000  
Error Set:
CONTAINER ID   NAME               CPU %     MEM USAGE / LIMIT     MEM %     NET I/O           BLOCK I/O        PIDS
cb346b1af076   test_storage_app   0.00%     56.93MiB / 15.33GiB   0.36%     6.34GB / 9.85GB   9.12MB / 41MB    21
d202016509a4   test_storage_db    0.00%     91.91MiB / 15.33GiB   0.59%     85.2MB / 6.3GB    51.5MB / 191MB   9
❯ cat stress/filter/targets.txt | ./vegeta attack -rate=500/1s -duration=30s | ./vegeta report && docker stats --no-stream
Requests      [total, rate, throughput]         15000, 500.03, 499.98
Duration      [total, attack, wait]             30.001s, 29.998s, 2.942ms
Latencies     [min, mean, 50, 90, 95, 99, max]  514.736µs, 4.987ms, 4.441ms, 7.915ms, 12.306ms, 16.244ms, 214.638ms
Bytes In      [total, mean]                     2500293000, 166686.20
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15000  
Error Set:
CONTAINER ID   NAME               CPU %     MEM USAGE / LIMIT     MEM %     NET I/O           BLOCK I/O        PIDS
cb346b1af076   test_storage_app   0.00%     59MiB / 15.33GiB      0.38%     7.96GB / 12.4GB   9.12MB / 41MB    21
d202016509a4   test_storage_db    0.02%     91.81MiB / 15.33GiB   0.58%     99.2MB / 7.91GB   51.5MB / 191MB   9